/**
 * Back cover page
 */
exports.getBackCover = function(data) {
    var backCover = [],
        header, criteria, policy, footer;

    header = {
        text: '\n10. หลักฐานหรือเอกสารประกอบการขอรับทุนที่แนบมาพร้อมแบบใบสมัคร',
        style: 'header'
    };


    criteria = {
        stack: [{
            ol: [
                'หนังสือรับรองเงินเดือนของบิดา / มารดา หรือผู้ปกครอง จำนวน  1 ชุด',
                {
                    stack: ['หนังสือรับรองฐานะครอบครัวของผู้สมัครขอทุน  จำนวน  1 ชุด โดยผู้รับรองต้องเป็น',
                        {
                            text: [
                                '- ข้าราชการผู้ดำรงตำแหน่งระดับ 5 ขึ้นไป หรือ ตำแหน่งเทียบเท่า (ทหาร/ตำรวจต้องมียศ ตั้งแต่พันตรีขึ้นไป หรือ',
                                '\n- ผู้ปกครองท้องถิ่นระดับผู้ใหญ่บ้านขึ้นไป (ตามแบบฟอร์มที่แนบ)'
                            ],
                            margin: [20, 0, 0, 0]
                        }
                    ]
                },
                'ใบรายงานผลการศึกษา  จำนวน  1 ชุด',
                'รูปถ่ายสภาพบ้าน และทรัพย์สินของครอบครัว  จำนวน  1 ชุด',
                'สำเนาทะเบียนบ้านของนิสิต / ผู้ปกครอง พร้อมเซ็นชื่อรับรองสำเนาถูกต้อง  จำนวน  1 ชุด',
                'สำเนาบัตรประจำตัวนิสิต พร้อมเซ็นชื่อรับรองฯ    จำนวน  2 ชุด',
                'สำเนาสมุดบัญชีธนาคาร(เฉพาะหน้าแรก) พร้อมเซ็นชื่อรับรองฯ    จำนวน  2 ชุด',
                'สำเนาบัตรประชาชนของนิสิต พร้อมเซ็นชื่อรับรองสำเนาถูกต้อง จำนวน  1 ชุด',
                'สำเนาบัตรประชาชนของผู้ปกครอง พร้อมเซ็นชื่อรับรองสำเนาถูกต้อง จำนวน  1 ชุด',
                'สำเนาบัตรประชาชน / ข้าราชการ ของผู้รับรองรายได้ของครอบครัว จำนวน  1 ชุด',
                'แบบคำขอรับเงินผ่านธนาคาร กรอกข้อมูล พร้อมเซ็นชื่อเรียบร้อย จำนวน  2  ชุด',
                'แบบใบสำคัญรับเงิน กรอกข้อมูล พร้อมเซ็นชื่อเรียบร้อย จำนวน  2 ชุด ',
                'เอกสารอื่น ๆ (ถ้ามี)'
            ]
        }],
        margin: [20, 0, 0, 20]
    };

    policy = {
        text: ['ข้าพเจ้าขอรับรองว่าข้อความที่กรอกไว้ในใบสมัครและหลักฐานเอกสารประกอบการสมัครนี้',
            'เป็นความจริงทุกประการ  โดยยินยอมให้มีการตรวจสอบข้อเท็จจริงเกี่ยวกับสภาพของครอบครัวและ',
            'ตัวข้าพเจ้า หากตรวจพบว่าข้อมูลบางส่วน หรือทั้งหมดเป็นเท็จ ข้าพเจ้ายินยอมชดใช้เงินทุนการศึกษา',
            'ที่ได้รับคืนทั้งหมด และยินยอมให้พิจารณาลงโทษ ตามระเบียบจุฬาลงกรณ์มหาวิทยาลัยว่าด้วยวินัยนิสิต'
        ],
        margin: [0, 0, 0, 40]
    };

    footer = {
        stack: [{
            text: '(ลงชื่อ).....................................................................ผู้สมัครขอรับทุน',
            margin: [0, 0, 70, 0]
        }, {
            text: '(........................................................) ',
            margin: [0, 0, 150, 0]
        }, {
            text: 'วันที่........./........./.........',
            margin: [0, 0, 180, 50]
        }, {
            text: '(ลงชื่อ).....................................................................บิดา / มารดา หรือผู้ปกครองนิสิต'
        }, {
            text: '(........................................................) ',
            margin: [0, 0, 150, 0]
        }, {
            text: 'วันที่........./........./.........',
            margin: [0, 0, 180, 0]
        }],
        alignment: 'right'
    };

    backCover.push(header);
    backCover.push(criteria);
    backCover.push(policy);
    backCover.push(footer);

    return backCover;
};
